/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "การทำงานไม่สำเร็จ";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "ข้อผิดพลาดที่ไม่ได้กำหนดเกิดขึ้น (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "ไม่สามารถกระทำให้เสร็จ";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "ลองอีกครั้งภายหลัง";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "ไม่สามารถอัดบันทึก";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "ลองอัดบันทึกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "ไม่สามารถอัดบันทึก";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้%@ และลองอีกครั้ง"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "ไม่สามารถอัดบันทึก";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "ลองอัดบันทึกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "ลองอัดบันทึกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "ไม่มีเนื้อที่ดิสก์พอที่จะเขียนลงไฟล์ต่อ ลบวิดีโอหรือรูปภาพที่มีอยู่จะทำให้มีเนื้อที่มากขึ้น";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "ลองอัดบันทึกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "ลองอัดบันทึกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "ได้ถึงช่วงเวลาสูงสุดของการอัดบันทึกนี้แล้ว"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "ได้ถึงขนาดมากสุดของการอัดบันทึกนี้แล้ว"; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้อุปกรณ์อัดบันทึกและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "ได้ถึงช่วงเวลาสูงสุดของการอัดบันทึกนี้แล้ว"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "ไม่สามารถอัดบันทึก";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "ลองอัดบันทึกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "ไม่สามารถใช้%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "หยุดการทำงานอื่นๆ ที่ใช้%@ และลองอีกครั้ง"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "ไม่สามารถใช้%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้%@ และลองอีกครั้ง"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "การอัดบันทึกหยุด";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้อุปกรณ์อัดบันทึกและลองอีกครั้ง";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "ไม่สามารถกระทำให้เสร็จ";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "ลองอีกครั้งภายหลัง";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "ไม่สามารถ export ให้เสร็จ";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "ลองทำ export อีกครั้ง";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "ไม่สามารถถอดรหัส";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "ไม่สามารถถอดรหัสข้อมูลสื่อได้ ข้อมูลสื่ออาจจะเสียหาย";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "ไม่รองรับรูปแบบของสื่อนี้";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "ไม่สามารถบันทึก";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "ลองบันทึกอีกครั้ง";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "ไม่สามารถใช้สื่อนี้ได้";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "ไม่สามารถใช้สื่อนี้ได้";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "ไม่สามารถใช้สื่อนี้ได้";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "ไม่สามารถใช้สื่อนี้ได้";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "ไม่รองรับรูปแบบของสื่อนี้";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "สื่อนี้อาจจะเสียหาย";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "ไม่สามารถถ่ายรูป";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "ลองถ่ายรูปอีกครั้ง";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "การทำงานนี้ไม่รองรับเนื้อหาที่ป้องกันไว้"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "ไม่อนุญาตเนื้อหานี้"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "แอปฯ นี้ไม่ได้รับอนุญาตให้เล่นไฟล์นี้"; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "ไม่สามารถใช้สื่อนี้ได้";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "ไม่สามารถถอดรหัส";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "ไม่สามารถหาวิธีถอดรหัสข้อมูลสำหรับสื่อนี้";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "ไม่สามารถเข้ารหัส";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "ไม่สามารถหาวิธีเข้ารหัสข้อมูลสำหรับสื่อนี้";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "ไม่สามารถถอดรหัส";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "ตัวถอดรหัสข้อมูลที่ต้องการสำหรับสื่อนี้ไม่ว่าง";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ถอดรหัสสื่อและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "ไม่สามารถเข้ารหัส";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "ตัวเข้ารหัสข้อมูลที่ต้องการสำหรับสื่อนี้ไม่ว่าง";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่เข้ารหัสสื่อและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "ไม่สามารถใช้%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "แอปฯ อาจจะไม่ใช้%@ ในขณะที่ทำงานอยู่เบื้องหลัง"; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "การทำงานนี้ไม่รองรับสื่อนี้";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "ไม่สามารถจัดทำวิดีโอขึ้นได้ตามวิธีการที่ให้มา";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "ไม่สามารถใช้สื่อนี้ได้";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "ไม่สามารถใช้ไฟล์แคชที่อยู่ที่ URL ปลายทางสำหรับดาวน์โหลด";
